[
    {
        "Title": "Top 15 teams in BeChangeMaker 2023 prepare for next pitch",
        "Summary": "Teams are working hard to develop their business ideas in our annual online training programme, but only five will make it to the finals, taking place alongside WorldSkills General Assembly from 25 to 28 September 2023 in Dublin, Ireland.",
        "Date": "08/03/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/1416/5642/4125/BCM2022_thumb.jpg",
        "Content": "This is the seventh edition of the popular programme hosted jointly by WorldSkills and the HP Foundation, which started in 2017. Taking place from June to September, the young social entrepreneurs are given access to high-quality learning content on HP LIFE, tools and technology for start-up acceleration.\n\nParticipants receive dedicated coaching, mentoring and customized support during the programme, as well as the opportunity to tap into a diverse global network of potential supporters and investors.\n\nOne of the successful teams in the first pitch – held online over two days on 25 and 26 July – was ‘I Hear U’ from Mexico. Their project promotes mental health for youth through technology, offering a solution that provides low-cost therapy, free emotional support, a supportive community, and valuable content and live sessions.\n\n“Mental health is a concern worldwide, with the high cost and limited access to services, yet only around 2% of health budgets on average are allocated to mental health,” said Raúl Velázquez, team leader of ‘I Hear U’. The main challenge for Raúl’s team is creating good partnerships, and Raul says that the mentoring received through BeChangeMaker has been extremely helpful.\n\nAnother team through to the next phase is an initiative in Uganda that aims at ensuring economic inclusion for refugees through self-reliance and women empowerment.\n\n“Refugees often only receive bare necessities, but they rarely have the chance to earn a living,” says Chantal Braunwalder, the Director and Founder of Team Spirit International.\n\n“Uganda offers the ground for change, with self-reliance as a key policy and providing refugees with land for cultivation. However, refugees still suffer from food insecurity and lack of livelihoods.” Coming from six different countries, their team identifies and bridges gaps in the agricultural supply chain and offering vocational training in agro-ecology and business.\n\nAnd from Azerbaijan, a human right lawyer joined a mobile app developer to help persons with disabilities know and attain their rights.\n\n“Collaboration has been at the heart of our project’s success,” says team leader Reyham Ramazanova. “Working together with the BeChangeMaker team, coach, and mentors has allowed us to pool diverse perspectives and ideas, leading to better development and refinement of our project. The opportunity to design, improve, and collaborate throughout this journey has been transformative, setting the foundation for a successful and impactful project.”\n\nOnly 5 of the 15 teams currently in the programme will be selected to take part in the intensive coaching, mentorship, and premium services that will take place during the last six weeks of the programme.\n\nTheir ideas will again be put to the test on 9 August during a second pitch deciding which businesses will go to the finals.\n\nGo to the BeChangeMaker website for more information on this year’s and past participants.\n\n"
    },
    {
        "Title": "Claim your digital badge and show off your WorldSkills experience!",
        "Summary": "Participants at WorldSkills Competition 2022 Special Edition, WorldSkills Kazan 2019, and WorldSkills Abu Dhabi 2017 have been issued digital credentials. If you haven't yet claimed your badge, the process is quick and easy. ",
        "Date": "08/02/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/7416/9097/1053/digital-badge-thumb-aug-2023.jpg",
        "Content": "In September 2022, WorldSkills partnered with Credly, the world’s largest digital credential network, to launch WorldSkills Digital Badges. These credentials are an instant, verifiable way for people to display their experience at WorldSkills Competitions. Since then, 4,000 badges have been issued.\n\nThe credentials are digital images containing verified metadata describing the role and achievements of people who participated in WorldSkills Competitions, including Competitors, Experts, and Delegates.\n\nThey are a great way to help employers, recruiters, colleagues, clients, and prospective clients understand how your WorldSkills experience has enhanced your abilities. Claiming, accepting, and sharing your badges also tells the world how they can grow, prosper, and learn with WorldSkills, helping us reach more people and continue changing worlds though the power of skills.\n\nBadges can be used in email signatures or digital resumes, as well as on social media sites such as LinkedIn, Facebook, and Twitter.\n\nSpecific badges have been issued to participants of:\n\nThe recipients are:\n\nParticipants at WorldSkills Competition 2022 Special Edition can additionally generate a certificate through their digital badge on the Credly platform.\n\nIf you are eligible for one of our credentials and have not yet received it or accepted it, you can begin the process online (requires log in) or email WorldSkills for help.\n\nFind out more about WorldSkills Digital Badges or go to the help section of Credly’s website for technical information, additional questions, and tutorials.\n\nIf you experience any issues obtaining your digital badge or digital certificate, please email WorldSkills IT support.\n\n"
    },
    {
        "Title": "City of Gdańsk readies for EuroSkills 2023",
        "Summary": "Watch a new promotional video to find out what awaits at EuroSkills Gdańsk 2023, taking place 5 to 9 September 2023 in Poland.",
        "Date": "08/01/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/2316/9089/0337/euroskills2023-thumb.jpg",
        "Content": "Organized by WorldSkills Europe together with 32 Member Countries, EuroSkills Competitions bring together 600 talented young professionals under the age of 25 to display their professional expertise. EuroSkills Competitors are the best of their peers, having been selected after taking part in national competitions in their respective countries.\n\nComing from across Poland and abroad, tens of thousands of visitors are expected to attend the event, which will be held at AmberExpo Gdańsk and Polsat Plus Arena Gdańsk. Besides the opportunity to see young professionals in action, visitors will be able to try hands-on job-related skills at the ‘Try-a-Skill’ demonstrations which will be featured throughout the Competition halls.\n\nThe Competitor (or group of Competitors) achieving the highest overall score from the hundreds of Competitors across over 40 skill competitions will receive the Jos de Goey Best in Europe Award.\n\n"
    },
    {
        "Title": "Germany’s young chefs get a taste for digital competition",
        "Summary": "How do you assess dishes digitally, when the plate of food and the judge may be hundreds of kilometres apart?",
        "Date": "07/31/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/7816/9078/8794/germany-digital-food-comp-2.jpg",
        "Content": "WorldSkills Germany faced a challenge with their National Skills Competition of Young Chefs, organized with the Regional Association of Chefs Lower Saxony. Four of the five competition modules were digital - hence the challenge. The solution was to design them in a way that would prepare participants for the cooks’ apprenticeship certification exam, but also demonstrate their skills with online tests or self-made videos.\n\nThis new way of thinking was embraced by instructors, says Thorben Grübnau, Vice President North of the German Chefs’ Association, WorldSkills Germany Expert and initiator and driving force behind the competition.\n\n“Trainers approached me and thanked me for the fact that the structure of the Competition had finally given them impulses on how to implement the topic of digitalisation in training,” he says.\n\n\"The competition thrives on the high standard of the examinations and thus generates a visible added value for the qualitative training of skilled workers.”\n\nAt the start of the year, 40 young chefs registered for what would be the first National Skills Competition of Young Chefs. Over 20 then battled through the preliminary round of four digital-only modules.\n\nOnly then did the final seven compete face to face in the final.\n\n“With this kind of competition - digital and analogue - it was our concern to keep participation low-threshold and at the same time create a great added value for the participants,\" says Grübnau.\n\nThe challenge for training and recruiting a skilled workforce is to “Make young people enjoy their jobs and at the same time give them the feeling that you are working with them on their strengths and weaknesses and are there to give them advice,” he says.\n\n“With the principle of ‘learning in Competition’ in the form of the National Competition for Young Chefs, we enable precisely this unique professional and personal development of young chefs.\"\n\nThe format of the competition allowed the young chefs to get feedback after each module, learning where they had lost points and how they could improve.\n\nOnline tasks included creating a main dish from a shopping basket of ingredients, using a smartphone for food photography, cutting up a guinea fowl and being able to carry out a conversation in simple English - an essential skill for international Competitions.\n\nThe final challenge was to cook a main course for eight people. Participants were only informed on site that two of the eight judges were children, so they had to spontaneously prepare two children’s dishes from the available ingredients.\n\nThe winner was 22-year-old Lennart Zankl from Lübeck, who is completing a course in food management.\n\n“The pressure during the final was enormous. That was the first time for me to experience something like that,” he said. “I am a little proud of myself, but I am also happy about all the experience I have gained here.\n\n"
    },
    {
        "Title": "Meet João Teixeira, the new Champions Trust representative for Europe",
        "Summary": "The gold Medallist for Mechanical Engineering CAD at WorldSkills Competition 2022 Special Edition joins the Champions Trust.",
        "Date": "07/27/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/5916/9045/1366/WSCT_app_photo_JTeixeira_2.jpg",
        "Content": "From the beautiful city of Porto in northern Portugal, João Teixeira knew he wanted to be part of WorldSkills from the moment he first heard about it.\n\nWhile looking for options beyond regular high school education, João found CENFIM, the national vocational training centre for the metallurgic and metalworking industry. As he looked through their course prospectus, he was drawn to CAD design.\n\n“Everything you see on the roads or at home has been built by someone, and that person put together a project to build it. And that’s what I like, we can design anything and make it happen in real life. We have no limits with CAD software,” says João.\n\nHis WorldSkills journey started soon after joining the centre. He immediately began practising and watching other Competitors, dedicating time to completing Test Projects to improve himself and prepare to compete.\n\nHe competed at the WorldSkills Portugal nationals, progressed to EuroSkills, and finally reached the world championship. At WorldSkills Competition 2022 Special Edition in Bordeaux, France he won a gold medal in Mechanical Engineering CAD.\n\nNow, at 22, João is an instructor at the very same vocational centre where he honed his skill. He trains young people from the ages of 15 to 20 in CAD designing, and soon in 3D metal printing.\n\n“We have recently acquired a 3D printer in metal and I am learning the machine to give training for the others in the future,” he says.\n\nAn instructor during the day, at night he is studying mechanical engineering at the polytechnic to get to the next level. He discovered a passion for cars when he started to learn how they were designed and built and realized that his future would not necessarily be always behind a computer. While he is enjoying every step of the journey, in the long term, he pictures himself managing design projects or heading a production line.\n\nOne of his goals as part of the WorldSkills Champions Trust is to change the public’s perceptions on vocational education and training, and to advocate for policy action.\n\n“In Portugal, we have lack technicians. Everyone wants to be a doctor, a lawyer, or an engineer. We have a lot of engineers that can make the project and select the materials… But they don’t know how to join them. It’s eventually the tradespersons who teach them how to join the parts,” says João.\n\nMany graduates are not fit for the available jobs, and are often left frustrated by pay scales that do not match their initial expectations.\n\nJoão hopes to spread awareness of the WorldSkills movement across Portugal and Europe and remind young Competitors that there is more to WorldSkills than earning a medal.\n\n“I was so focused on succeeding that I didn’t talk with many people during the breaks. I never spoke with anyone. And I regret that because WorldSkills is also about meeting new people, from different cultures and I missed on that,” he says.\n\nNow that he is part of the WorldSkills Champions Trust, he says he wants to be the person that makes the group more united and makes everyone feel happy and positive.\n\n"
    },
    {
        "Title": "WorldSkills Members around the world put their young people to the test",
        "Summary": "In recent months, WorldSkills Members have hosted National Competitions across four continents to prepare teams for WorldSkills Lyon 2024.",
        "Date": "07/24/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/9316/9020/8509/worldskills-members-collage.jpg",
        "Content": "Around the world, WorldSkills Members are putting the talents and skills of their young people to the test, hosting National Competitions to prepare their teams for WorldSkills Lyon 2024 in France in September next year.\n\nIn over a dozen countries across four continents, young people have demonstrated incredible skills and commitment to learning, while celebrating diversity and inclusion.\n\nIn Denmark, the National Skills Competition attracted over 50,000 visitors and saw 45 young people take home medals for skills ranging from furniture upholstery to baking. Their positive attitude to vocational skills, “brings joy to be here with them,” said Søren Heisel, Chair of SkillsDenmark.\n\nIt was also clear young people were increasingly following a green agenda, he said. “In the vocational training courses around the country, there is a great focus on sustainability, and this could also be seen at many of the competition stands.”\n\nMarch saw a burst of national competitions, including Portugal, the United Arab Emirates, Thailand, and the Netherlands.\n\nAs Portugal ended its competition, EmiratesSkills was beginning theirs at the Abu Dhabi National Exhibition Centre, the venue for WorldSkills Abu Dhabi 2017. Over 50 young men and women won gold, silver, and bronze medals in 23 skill competitions. It was the largest national vocational skills competition in the UAE and was watched by the country’s vice president Sheikh Mansour bin Zayed.\n\nMarch concluded with the Grand Est Regional Finals at the city of Metz in France, and the 10th International Abilympics, the skills global competition for people with disabilities, organized in partnership with WorldSkills France.\n\nSkillsLatvia and WordSkills Hong Kong shared the spotlight in April and May holding national competitions on different sides of the world.\n\nFour new skills — Bakery, Hotel Reception, Freight Forwarding, and IT Network Systems Administration — were added to the Hong Kong national competition, with the winners now preparing for WorldSkills Lyon 2024.\n\nAlso in Asia, it was the turn of WorldSkills Thailand, whose 29th national competition was held across six venues in late May. The winners were presented with their medals by Boonchob Sutthamanatwong, Thailand’s Permanent Secretary of Labour, who told them this was only the start of a successful life and a stable job. He added: “We must not stop developing and must learn all the time because the world today is constantly changing. We must adapt to keep up with changes, especially in technology.”\n\nIn Europe, Croatia, Finland, and Sweden held their national competitions in May. WorldSkills Croatia attracted over 10,000 visitors, including students from 100 elementary schools, with an event that included two new disciplines — Nutri-vita and Tourist destination, specializing in nutritious eating and trends in tourism respectively.\n\nCrossing the Atlantic at the end of May, the Skills Canada National Competition was held in Winnipeg, Manitoba, bringing together over 500 Competitors in 40 skills and introducing a Skills Showcase featuring First Nations, Inuit, and Métis indigenous skills that included flat stitch beading, soapstone carving, and building mini tipis.\n\nIn June, it was the turn of the Caribbean, with the Dominican Republic also selecting the team for future regional and international competitions from its national competition winners.\n\nFor Jamaica, the first Caribbean country to join WorldSkills, it was their eighth national competition, with 230 young people and 35 skills under the WorldSkills Lyon 2024 “Where there is a Skill, there is a Way.”\n\nAs WorldSkills International CEO David Hoey told those taking part: “Skills will not only get you a job, they will also help you fulfil your ambitions – with confidence. Skills can change your life for the better and enable you to bring positive impact into your communities.”\n\n"
    },
    {
        "Title": "New initiative sparks innovation from VET students and trainers in the Dominican Republic",
        "Summary": "The project from the Dominican Republic’s INFOTEP encourages innovation and entrepreneurship across skills.",
        "Date": "07/20/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/9816/8985/8187/Dominican_Republic_Innovatep-thumb.jpg",
        "Content": "An automated tiny house, an inverter-powered fridge, and a chatbot that can help students join Vocational Education and Training (VET) are some of the inventions developed by students and trainers of the Dominican Republic’s National Institute of Technical and Vocational Training, or INFOTEP in Spanish.\n\nFor a year, anyone part of the INFOTEP’s centres – from administration staff and workshop managers to students – could join forces and use the institution’s resources to come up with an innovative product. Thirty-six projects came forward, some led by former WorldSkills Experts and Competitors.\n\n“INNOVATEP aimed to be a space to celebrate the talent of skilled Dominicans, where they could showcase their capabilities to innovate. The idea was to promote the development of soft skills such as team work and interdisciplinary collaboration, and support them so they would feel free to combine their skills in the way they deemed appropriate,” says Rosanny Contreras, the project’s coordinator.\n\nThe institute engaged an international consultant to provide mentoring and support to the teams in developing the technical part of their projects. INFOTEP helped them in administrative aspects such as project drafting, developing budgets for prototypes, and marketing.\n\nAlexander Grullón, a bronze Medalist at WorldSkills America Chile 2018 for Refrigeration and Air Conditioning, came up with a beach fridge.\n\nThe fridge works with an inverter, providing seven to eight hours of cooling without having to be plugged in. A boon for picnickers, ice-cream vendors and shopkeepers, the invention could also be used to transport and refrigerate medicines in rural areas or zones with an unstable power supply.\n\n“The interesting part is that it has a chip that controls the speed according to the inside temperature. Well, this chip was developed thanks to our colleagues in the electronics department here at INFOTEP Cibao Norte,” explains Alexander, evidence of the type of cross-departmental collaborations that took place.\n\nAnother project, called Vortex, uses a chatbot to streamline communication with prospective VET students. Its developer, Cristian Núñez, competed in Web Technologies at WorldSkills São Paulo 2015.\n\nUsing Google’s DialogFlow technology, he developed a chatbot that goes beyond helping students find the right skill for them and how to enroll.\n\n“We are hoping to obtain metadata on the courses that are most in demand, about demographics of prospective students, or what are the courses that work best depending on regions. This way, we can better plan the offer of INFOTEP and our strategy as an institution,” he says.\n\nAnother of the projects – a tiny house which has everything a person may need – was developed between the electrical and the woodworking departments. WorldSkills Americas 2012 Expert in Cabinetmaking, Juan Leonardo, explains that the idea came to them after reading that the Dominican Republic has a 60 percent housing deficit.\n\nTheir project has already attracted private investors, and INFOTEP is providing them support in terms of copyright and patenting.\n\nThe 36 projects have now entered a new phase, where they will receive specific training and mentoring on entrepreneurship. Furthermore, acknowledging the country’s financial obstacles for start-ups and small enterprises, INFOTEP and the Government of the Dominican Republic are working jointly to provide interest-free credits that can help teams accelerate their ideas.\n\nThe Dominican Republic, through INFOTEP, has been a member of WorldSkills Americas since 2010, and of WorldSkills International since 2012.\n\n"
    },
    {
        "Title": "World Bank, ILO, UNESCO release study on TVET reforms in developing economies",
        "Summary": "WorldSkills Champions Trust representative Shweta Ratanpura spoke at the report launch event ahead of World Youth Skills Day.",
        "Date": "07/19/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/8616/9021/5280/TVET-report-2023.jpg",
        "Content": "A new study by the World Bank, the ILO, and UNESCO brings together global knowledge on Technical Vocational and Education Training (TVET) reforms to create guidelines for low and middle-income countries.\n\nThe “Building Better Formal TVET Systems: Principles and Practice in Low- and Middle-Income Countries” report is considered the first rigorous global analysis of TVET challenges and reforms in developing economies.\n\nDespite TVET’s potential to curb alarming global youth unemployment rates and promote sustainable development, the report says that TVET systems in many low and middle-income countries are unprepared for the forecasted rise in demand. The report outlines how large skill mismatches between labour market needs are derived from globalization, technological progress, demographic transformation, and climate change.\n\nTVET systems often underperform due to difficulties facing learners, unsupported teachers, and weak incentives for training providers. Based on lessons learned from TVET reforms and the COVID-19 pandemic, the report offers three fundamental transformations to create better TVET systems.\n\nIt encourages TVET providers to move “from striving for recognition, to striving for excellence,” and suggests providers take a client-oriented approach towards both enterprises and learners, prioritize foundational skills, and impart relevant technical skills, and promote an integrated ecosystem that allows flexibility, fosters quality, and engages teachers.\n\nThe report also recommends a focus on end results, which translates into strengthening the government’s role in quality assurance, empowering enterprises and learners to use their client power, and realigning TVET funding to reward reforms and results. Finally, it calls for governments to increase data collection so that decisions and systemic reforms are driven by evidence.\n\nLaunched on 12 July through a virtual event – “Building Better Formal TVET Systems” – aligned with celebrations around World Youth Skills Day.\n\nThe report was published live by the World Bank Vice President for Human Development, the ILO Assistant Director General for Jobs and Social Protection, the UNESCO Assistant Director General for Education, and representatives from government, TVET institutions, and youth.\n\nIt was then followed by a presentation of the key messages, and a panel discussion under the title “Lessons on TVET reforms in L/MICs.” WorldSkills Champions Trust representative for Asia, Shweta Ratanpura, from India, participated in the panel alongside policymakers from Ecuador, Ethiopia, and the Philippines.\n\nShweta shared her experience in pursuing a TVET career in India. While explaining how TVET is perceived as a second-tier track, along with societal and gender biases, she stressed the need for more awareness of the career opportunities, pay scales, and work conditions in TVET careers. This information, she said, is scarce and hard to obtain.\n\n“Enrolling in extracurricular courses and external classes helped me build my skill over the years. That’s why I think it’s important that vocational training is included in the education system early on. If it’s part of the system more and more people would be encouraged to do the same,” she said as she highlighted the effect of role models to engage more women in TVET.\n\n“In short, the most important takeaway is to bring change. Whether as a student, or as a parent, educator, or policymaker, we all hold the power to contribute to raising awareness, countering biases, and strengthening our education system,” she concluded.\n\nA recording of the event and related information is available on the World Bank’s official event page.\n\nDownload the full report “Building Better Formal TVET Systems: Principles and Practice in Low- and Middle-Income Countries”. It will be available in French and Spanish in the near future.\n\n"
    },
    {
        "Title": "Watch videos from WorldSkills and UNESCO-UNEVOC event to celebrate World Youth Skills Day",
        "Summary": "The event on 14 July in Germany included WorldSkills Champions giving their perspectives and expectations for VET systems that can support youth transition from school into the world of work.",
        "Date": "07/18/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/8516/8976/1998/unevoc-wysd-2023-thumb.jpg",
        "Content": "To celebrate World Youth Skills Day (15 July) WorldSkills and UNESCO-UNEVOC co-organized an event packed with insights and knowledge from youth on how to better prepare young people for the future of work.\n\nThe hybrid event, hosted in collaboration with WorldSkills Germany, took place on 14 July in Bonn, Germany and online. It brought together former WorldSkills Champions and apprentices, alongside policymakers and diverse stakeholders within the skills landscape in Germany and beyond.\n\nThe opening remarks were delivered by:\n\nAs she expressed her excitement to hear directly from the incredible skilled youth in the different panels, Laurence Gates, said it was their perspective, ideas, and challenging questions that should be heard on World Youth Skills Day, and every day.\n\n“We are all committed to helping you develop the skills you need for tomorrow, because our world is becoming more turbulent and uncertain. Change will only happen when educators, industries, and policymakers work together to redesign our VET systems for sustainable human and economic development,” said Laurence Gates.\n\nThe first discussion included Aswatha Narayana Sanagavarapu, gold Medalist from WorldSkills Kazan 2019, taking part in a youth focus group on improving teaching and learning processes. With the added insights of a recent UNESCO-UNEVOC youth survey, the panel aimed at amplifying youth priorities and expectations for the future of skills development.\n\nAswatha, who competed in Water Technology, said that his WorldSkills journey was transformational for him.\n\n“When it comes to my experience as an engineering graduate, I saw that most often the knowledge is limited to the theoretical aspects, and it lacks the practical approach of the real world. Hence, I strongly believe competitions and apprenticeships can do a lot in bridging the gap of knowledge and skills,” he said.\n\nThe focus group was followed by a panel around the theme for this year’s World Youth Skills Day – Skilling teachers, trainers and youth for a transformative future. WorldSkills Champions Trust representative, Sonya Hill joined from Jamaica to share her experience of transitioning from school to work.\n\n“Regardless of having and engineering degree and having competed at WorldSkills, there were skill gaps that hindered my performance in the work environment. I was provided by a solid theoretical foundation, but I got no exposure to practical experience and technologies used within industry, which made it very challenging for me to quickly adapt and effectively apply my knowledge,” said Sonya.\n\nShe added that to better support youth, TVET institutions should frequently update their curricula, and machinery to match that of industry. Partnerships can provide opportunities for students to develop more practical skills while they are still in school to accelerate their readiness for the labour market.\n\nAs UNESCO’s designated centre for technical and vocational education and training (TVET), UNESCO-UNEVOC supports Member States in their efforts to strengthen and upgrade their TVET systems and ensures access to quality skills training and development for all. UNESCO-UNEVOC is a partner of the WorldSkills Conference Coalition, and a long-term partner of WorldSkills.\n\n"
    },
    {
        "Title": "We are WorldSkills. Prosper with us.",
        "Summary": "Be motivated by research from WorldSkills UK which puts a financial value on investment in skills.",
        "Date": "07/18/2023",
        "Image": "https://worldskills.org/application/files/thumbnails/landscape/9116/8967/2289/WAWS_Impact_Story_UK2_L-tweaked-thumb.jpg",
        "Content": "The benefits of WorldSkills reach far past personal accomplishments, competition prizes, and individual progress. When we invest in youth skills, we all benefit financially.\n\nSeeking to put a figure on the impact of upskilling the next generation of technically adept young people on the UK’s industry and economy, WorldSkills UK commissioned microeconomics experts Frontier Economics to quantify the contribution and value of its training.\n\nFindings released over 2021 and 2022 tell a tale of ever-increasing returns. The research demonstrates that training tomorrow’s leaders could pay back more than four-fold, representing as much as a £4.50 return on every £1 of investment made by the Department for Education.\n\nSource: Frontier Economics for WorldSkills UK\n\nTechnically skilled young people enjoy a greater financial return on their time, energy, and passion, finding themselves more employable, and more valuable to businesses. Those with the highest levels of technical prowess can earn on average £14,000 more than their less-skilled peers. Compared to the average earnings of their peers in the UK, self-reported earnings from WorldSkills Competitors between 2011 and 2018 were 60% higher. \n\n"
    }
]